NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B820F2048IL152.svd
        <register>
          <name>EM23PERNORETAINSTATUS</name>
          <description>Status Indicating If Peripherals Were Powered Down in EM23, Subsequently Locking Access to It</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>ACMP0LOCKED</name>
              <description>Indicates If ACMP0 Powered Down During EM23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACMP1LOCKED</name>
              <description>Indicates If ACMP1 Powered Down During EM23</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCNT0LOCKED</name>
              <description>Indicates If PCNT0 Powered Down During EM23</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCNT1LOCKED</name>
              <description>Indicates If PCNT1 Powered Down During EM23</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCNT2LOCKED</name>
              <description>Indicates If PCNT2 Powered Down During EM23</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C0LOCKED</name>
              <description>Indicates If I2C0 Powered Down During EM23</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C1LOCKED</name>
              <description>Indicates If I2C1 Powered Down During EM23</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAC0LOCKED</name>
              <description>Indicates If DAC0 Powered Down During EM23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDAC0LOCKED</name>
              <description>Indicates If IDAC0 Powered Down During EM23</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0LOCKED</name>
              <description>Indicates If ADC0 Powered Down During EM23</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LETIMER0LOCKED</name>
              <description>Indicates If LETIMER0 Powered Down During EM23</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDOG0LOCKED</name>
              <description>Indicates If WDOG0 Powered Down During EM23</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDOG1LOCKED</name>
              <description>Indicates If WDOG1 Powered Down During EM23</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LESENSE0LOCKED</name>
              <description>Indicates If LESENSE0 Powered Down During EM23</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSENLOCKED</name>
              <description>Indicates If CSEN Powered Down During EM23</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LEUART0LOCKED</name>
              <description>Indicates If LEUART0 Powered Down During EM23</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LEUART1LOCKED</name>
              <description>Indicates If LEUART1 Powered Down During EM23</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LCDLOCKED</name>
              <description>Indicates If LCD Powered Down During EM23</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LETIMER1LOCKED</name>
              <description>Indicates If LETIMER1 Powered Down During EM23</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C2LOCKED</name>
              <description>Indicates If I2C2 Powered Down During EM23</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1LOCKED</name>
              <description>Indicates If ADC1 Powered Down During EM23</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACMP2LOCKED</name>
              <description>Indicates If ACMP2 Powered Down During EM23</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACMP3LOCKED</name>
              <description>Indicates If ACMP3 Powered Down During EM23</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTCLOCKED</name>
              <description>Indicates If RTC Powered Down During EM23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USBLOCKED</name>
              <description>Indicates If USB Powered Down During EM23</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23PERNORETAINCTRL</name>
          <description>When Set Corresponding Peripherals May Get Powered Down in EM23</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>ACMP0DIS</name>
              <description>Allow Power Down of ACMP0 During EM23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP1DIS</name>
              <description>Allow Power Down of ACMP1 During EM23</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0DIS</name>
              <description>Allow Power Down of PCNT0 During EM23</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT1DIS</name>
              <description>Allow Power Down of PCNT1 During EM23</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT2DIS</name>
              <description>Allow Power Down of PCNT2 During EM23</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0DIS</name>
              <description>Allow Power Down of I2C0 During EM23</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1DIS</name>
              <description>Allow Power Down of I2C1 During EM23</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDAC0DIS</name>
              <description>Allow Power Down of DAC0 During EM23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAC0DIS</name>
              <description>Allow Power Down of IDAC0 During EM23</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0DIS</name>
              <description>Allow Power Down of ADC0 During EM23</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LETIMER0DIS</name>
              <description>Allow Power Down of LETIMER0 During EM23</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDOG0DIS</name>
              <description>Allow Power Down of WDOG0 During EM23</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDOG1DIS</name>
              <description>Allow Power Down of WDOG1 During EM23</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LESENSE0DIS</name>
              <description>Allow Power Down of LESENSE0 During EM23</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSENDIS</name>
              <description>Allow Power Down of CSEN During EM23</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEUART0DIS</name>
              <description>Allow Power Down of LEUART0 During EM23</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEUART1DIS</name>
              <description>Allow Power Down of LEUART1 During EM23</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDDIS</name>
              <description>Allow Power Down of LCD During EM23</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LETIMER1DIS</name>
              <description>Allow Power Down of LETIMER1 During EM23</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2DIS</name>
              <description>Allow Power Down of I2C2 During EM23</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1DIS</name>
              <description>Allow Power Down of ADC1 During EM23</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP2DIS</name>
              <description>Allow Power Down of ACMP2 During EM23</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP3DIS</name>
              <description>Allow Power Down of ACMP3 During EM23</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCDIS</name>
              <description>Allow Power Down of RTC During EM23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBDIS</name>
              <description>Allow Power Down of USB During EM23</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
