NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B820F2048IL152.svd
        <register>
          <name>PERCTRL</name>
          <description>Peripheral Control Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FF0014F</resetMask>
          <fields>
            <field>
              <name>DACCH0EN</name>
              <description>VDAC CH0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCH1EN</name>
              <description>VDAC CH1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCH0DATA</name>
              <description>VDAC CH0 Data Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCH1DATA</name>
              <description>VDAC CH1 Data Selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACSTARTUP</name>
              <description>VDAC Startup Configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCONVTRIG</name>
              <description>VDAC Conversion Trigger Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP0MODE</name>
              <description>ACMP0 Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LESENSE does not control ACMP0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX</name>
                  <description>LESENSE controls the input mux (POSSEL) of ACMP0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUXTHRES</name>
                  <description>LESENSE controls the input mux (POSSEL) and the threshold value (VDDLEVEL) of ACMP0</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP1MODE</name>
              <description>ACMP1 Mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LESENSE does not control ACMP1</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX</name>
                  <description>LESENSE controls the input mux (POSSEL) of ACMP1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUXTHRES</name>
                  <description>LESENSE controls the input mux and the threshold value (VDDLEVEL) of ACMP1</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP0INV</name>
              <description>Invert Analog Comparator 0 Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP1INV</name>
              <description>Invert Analog Comparator 1 Output</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP0HYSTEN</name>
              <description>ACMP0 Hysteresis Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP1HYSTEN</name>
              <description>ACMP1 Hysteresis Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WARMUPMODE</name>
              <description>ACMP and VDAC Duty Cycle Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The analog comparators and VDAC are shut down when LESENSE is idle</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEEPACMPWARM</name>
                  <description>The analog comparators are kept powered up when LESENSE is idle</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEEPDACWARM</name>
                  <description>The VDAC is kept powered up when LESENSE is idle</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEEPACMPDACWARM</name>
                  <description>The analog comparators and VDAC are kept powered up when LESENSE is idle</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
